[
  "Ooh yeah! The cream of the crop!",
  "I'm the tower of power, too sweet to be sour, funky like a monkey, sky's the limit and space is the place!",
  "I've been to the top of the mountain, and the bottom of the barrel. And everywhere in between.",
  "The beat goes on... the beat goes on, yeah!",
  "I'm not a racist, I'm not a sexist, I'm a Macho Man.",
  "Snap into a Slim Jim! Ooh yeah!",
  "I'm the past, present, and future of professional wrestling.",
  "Expect the unexpected in the kingdom of madness!",
  "The Macho Man is on a roll! Yeah!",
  "Hulkamania is like a single grain of sand in the Sahara desert that is Macho Madness.",
  "The madness is running wild!",
  "You may not like it, but accept it. I'm the cream of the crop!",
  "I've got you for three minutes... three minutes of playtime!",
  "I'm too hot to handle and too cold to hold!",
  "The best there is, was, and ever will be, yeah!",
  "I'm the man of the hour, the man with the power, too sweet to be sour!",
  "I'm going straight to the top, oh yeah!",
  "Bonesaw is ready!",
  "Freak out, freak out!",
  "You're nothing but garbage, yeah!",
  "I am the cream in the World Wrestling Federation, and there is no doubt about it, yeah!",
  "Dig it! I'm talkin' about all the way to the top, yeah!",
  "I am the greatest, I don't have to be modest!",
  "I'm a winner, yeah, and I wear the gold!",
  "History beckons the Macho Man!",
  "I'm the Macho Man Randy Savage, and the madness is here!",
  "I'm gonna crush you, yeah, like a can of beer!",
  "I'm not a coward, I'm not a fool, I'm the Macho Man!",
  "The spotlight is on me, and I'm ready to shine!",
  "You ain't seen nothing yet, yeah!",
  "I'm gonna crush you, yeah, like a can of beer!",
  "I'm the lord and master of the ring!",
  "There's no stopping the madness!",
  "I've got the guts and I know what I want, and I want it all!",
  "The Macho Man is unstoppable, oh yeah!",
  "I've got the brains and the brawn, and I'll take anyone down!",
  "You step into the ring with me, and you're stepping into the madness!",
  "I'm not the cream of the crop by accident!",
  "I'm the cream, yeah, rising to the top!",
  "You talk about being the best, well, the Macho Man is the best!",
  "I'm not afraid of anything or anyone, yeah!",
  "No one can handle the madness!",
  "The Macho Man is always ready for a fight!",
  "I've got the power, the strength, and the will to win!",
  "When you mess with the Macho Man, you mess with the best!",
  "I'm a born champion, and no one can take that away from me!",
  "I'm in control, and no one can stop me!",
  "The madness never stops!",
  "You can't beat me, you can only hope to survive!",
  "I'm a man on a mission, and I'll take down anyone who stands in my way!",
  "I'm the ultimate warrior of the ring!",
  "When you feel the madness, you know the Macho Man is here!",
  "I'm always ready to go the distance, oh yeah!",
  "You step up to the Macho Man, and you're gonna get taken down!",
  "The Macho Man is on a roll, and nothing can stop me!",
  "I've cried a thousand times and I'm gonna cry some more. But, I've soared with eagles and slithered with the snakes and everywhere in between and I'm gonna tell you something right now: there's one guarantee in life and that is that there are no guarantees, yeah."
]